app/controllers/api/africa_emojis_controller.rb

INSERT INTO "africa_emojis" ("created_at", "updated_at") VALUES ($1, $2) RETURNING "id"  [["created_at", 2017-02-02 07:05:51 UTC], ["updated_at", 2017-02-02 07:05:51 UTC]]
---
  def index
    @africa_tweets = TwitterApi.africa_tweets
    AfricaEmoji.create(emojis: @africa_tweets)

SELECT  "africa_emojis".* FROM "africa_emojis" ORDER BY "africa_emojis"."id" DESC LIMIT $1  [["LIMIT", 1]]
---
  def show
    @africa_tweets = AfricaEmoji.last