app/controllers/api/asia_emojis_controller.rb

  def index
    @asia_tweets = TwitterApi.asia_tweets
    AsiaEmoji.create(emojis: @asia_tweets)
---
INSERT INTO "asia_emojis" ("created_at", "updated_at") VALUES ($1, $2) RETURNING "id"  [["created_at", 2017-02-02 04:02:04 UTC], ["updated_at", 2017-02-02 04:02:04 UTC]]

  def show
    @asia_tweets = AsiaEmoji.last.emojis
---
SELECT  "asia_emojis".* FROM "asia_emojis" ORDER BY "asia_emojis"."id" DESC LIMIT $1  [["LIMIT", 1]]