app/controllers/api/emojis_controller.rb

  def index
    @tweets = TwitterApi.tweets
    Emoji.create(emojis: @tweets)
---
INSERT INTO "emojis" ("emojis", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"

  def show
    @tweets = Emoji.last
---
SELECT  "emojis".* FROM "emojis" ORDER BY "emojis"."id" DESC LIMIT $1  [["LIMIT", 1]]