app/controllers/api/europe_emojis_controller.rb

INSERT INTO "europe_emojis" ("emojis", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"
---
  def index
    @europe_tweets = TwitterApi.europe
    EuropeEmoji.create(emojis: @europe_tweets)