app/controllers/api/us_emojis_controller.rb

  def index
    @us_tweets = TwitterApi.us_tweets
    UsEmoji.create(emojis: @us_tweets)
---
INSERT INTO "us_emojis" ("emojis", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"