app/controllers/api/world_emojis_controller.rb

INSERT INTO "world_emojis" ("emojis", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"
---
  def index
    @world_tweets = TwitterApi.world2
    WorldEmoji.create(emojis: @world_tweets)

SELECT  "world_emojis".* FROM "world_emojis" ORDER BY "world_emojis"."id" DESC LIMIT $1  [["LIMIT", 1]]
---
  def show
    @world_tweets = WorldEmoji.last.emojis